const forms = [
    "NFC",
    "NFD",
    "NFKC",
    "NFKD"
]

//todo можно заменить на двумерный массив, искать в каждом "ключи", и после отдавать рандомный(не считая "ключа") из массива.
const twinsCharacters = {
    'а': '\u0061', //ру-англ
    'А': '\u0041',
    // 'в': 'в',
    'В':'\u0042',
    'г': '\u1d26',
     'Г': '\u0393',
    // 'д': 'д',

    'е': 'e', //ру-англ

    // 'ё': 'ё',
    // 'ж': 'ж',
    // 'з': 'з',
    // 'и': 'и',
    // 'й': 'й',
    '\u043a': "\u03ba",
    // 'л': 'л',
    'м': '\u1D0D',// ru-latin
    'М': 'M', //ру-анго
    'н': '\u029C',
    'о': '\u006f', //ру-англ

    // 'п': 'п',

    'р': 'p',//ру-англ

    'с': 'c',//ру-англ

    // 'т': 'т',
    // 'у': 'у',
    // 'ф': 'ф',

    'х': 'x', //ру-англ

    // 'ц': 'ц',
    // 'ч': 'ч',
    // 'ш': 'ш',
    // 'щ': 'щ',
    // 'ъ': 'ъ',
    // 'ы': 'ы',
    // 'ь': 'ь',
    // 'э': 'э', //U+03F6 греч
    // 'ю': 'ю',
    // 'я': 'я',


}

export const confuseSymbol = (ch) =>{
    return  twinsCharacters[ch] ? twinsCharacters[ch] : ch
}

export const confuse = (str) => {
    let res = []
   for(let i = 0; i < str.length; i++){
       res[i] = confuseSymbol(str[i])
   }

   return res.join('').toString()
}

